[
    {
        "name" : "User Personalization",
        "title" : "User Personalization",
        "recipe" : "Amazon Personalize Recipe: TBD",
        "text": "This use-case is implemented on the bottom half of the Retail Demo Store home view. Product recommendations in the Inspired by your shopping trends section are powered by Amazon Personalize. If you're not signed in, featured products will be displayed here instead.Try using different shoppers to experience the difference in personalized product recommendations.",
        "italicText": "To change shopper, click on the name of the shopper located in the top right corner."
    },
    {
        "name" : "Similar items",
        "title" : "Similar items"
    },
    {
        "name" : "Personalized ranking",
        "title" : "Personalized ranking"
    },
    {
        "name" : "Real time events",
        "title" : "Real time events"
    },
    {
        "name" : "Welcome Email",
        "title" : "Welcome Email"
    },
    {
        "name" : "Abandoned cart email",
        "title" : "Abandoned cart email"
    },
    {
        "name" : "Text alerts(SMS)",
        "title": "Text alerts(SMS)"
    },
    {
        "name" : "Chatbot conversational interfaces",
        "title": "Chatbot conversational interfaces"
    },
    {
        "name" : "Is Amazon Personalize the right solution for my business?",
        "title" : "Find out why Amazon Personalize is right for your business",
        "orderedlist": [
            {"item": "Experience from Amazon: Over 20 years of personalization research and experience at <a href=\"https://www.amazon.com/\">Amazon.com</a>"},
            {"item": "Machine learning  based personalization: Delivers higher quality product and content recommendations, and targeted marketing promotions using machine learning and customer’s data set"},
            {"item" : "No machine learning experience required: All of the complicated and time consuming steps required to build, train, and deploy a machine learning personalization solution are automated"},
            {"item" : " Personalization in days, not months: Easily integrates into your existing websites, apps, SMS, and email marketing systems so you can implement a sophisticated and scalable personalization solution in days, rather than months."},
            {"item": "Proven success in improving customer engagement and conversion: <b>Lotte Mart</b>, a leading South Korean retailer with over 600K coupon mobile app users, has seen a 40% increase in the number of products a consumer has not previously purchased. <b>StockX,</b> a Detroit startup company revolutionizing ecommerce with a unique Bid/Ask marketplace, added a Recommended For You product row to the homepage using <a href=\"https://aws.amazon.com/personalize\">Amazon Personalize </a>, which ultimately became the top-performing homepage row. <b>Mecca,</b> a beauty retailer in Australia and New Zealand, realized a 65% increase in e-mail click-through rates and a corresponding increase in email revenue relating to the products recommended by Amazon Personalize. To personalize their customer experience further, they are now extending the use of Amazon Personalize to additional areas including our website."}
        ]
    
    },
    {
        "name": "What data should I provide?",
        "title": "What data should I provide?",
        "text": "Amazon Personalize recognizes three types of historical data: <ul> <li> Users - This data is intended to provide information about your users such as age, gender, or loyalty membership, which can be important signals in personalization systems.</li> <li>Items - This data is intended to provide information about your items, such as price, SKU type, or availability. </li><li>Interactions - This data is  historical interactions between users and items. It can also provide information on your user's browsing context, such as their location or device (mobile, tablet, desktop, and so on). </li> <br> <p>The user and item data are metadata types and only used in certain use cases. Please see this documentation for further technical details. <br> Each type of data that Amazon Personalize recognizes has required fields, reserved keywords and datatypes. Please see table below for details.Each type of data that Amazon Personalize recognizes has required fields, reserved keywords and datatypes. Please see table below for details.<table class=\"w-50\"><tr class=\"bg-light\"><th></th><th>Dataset Type</th><th>Required Fields</th><th>Reserved Keywords</th></tr><tr><td class=\"bg-light\">1</td><td>Users</td><td>USER ID(string) 1 metadata field</td><td></td></tr><tr><td class=\"bg-light\">2</td><td>Items</td><td>ITEM_ID (string) 1 metadata field</td><td>CREATION_TIMESTAMP(long)</td></tr><tr><td class=\"bg-light\">3</td><td>Interactions</td><td>USER ID (string) ITEM ID(string) TIMESTAMP(long)</td><td>EVENT TYPE(string) IMPRESSION(string) EVENT VALUE(float,null)</td></tr></table><br>Amazon Personalize will train and deploy a model based on this data. Developers can then use a simple inference API to get individualized recommendations at run-time and generate a personalized experience for the end users according to the type of personalization model (e.g. user personalization, similar items or personalized rankings). Amazon Personalize works best for large datasets that have over 50 users, 50 items, and 1500 interactions."
    },
    {
        "name": "Metrics and understanding impact",
        "title": "Metrics and understanding impact",
        "text": "<p>You can measure the performance of ML recommender systems using offline and online metrics.</p><p>Online metrics are the empirical results observed in your user’s interactions with real-time recommendations provided in a live environment. Business value here.</p><p>Offline metrics allow you to view the effects of modifying hyperparameters and algorithms used to train your models, calculated against historical data.</p><p>Amazon Personalize generates offline metrics using test datasets derived from the historical data you provide. These metrics showcase how the model recommendations performed against historical data. Offline metrics are a great representation of how your hyperparameters and data features influence your model’s performance against historical data. To find empirical evidence of the impact of Amazon Personalize recommendations on your business metrics, such as click-through rate, conversion rate, or revenue, you should test these recommendations in a live environment, getting them in front of your customers.</p><br><p>Learn more <a href=\"https://aws.amazon.com/blogs/machine-learning/using-a-b-testing-to-measure-the-efficacy-of-recommendations-generated-by-amazon-personalize/\">here.</a></p>"
    },
    {
        "name": "Real time personalization based on real time user activity",
        "title": "Real time personalization based on real time user activity",
        "text": "<p>Amazon Personalize can capture live events from your users to achieve real-time personalization. Amazon Personalize can blend real-time user activity data with existing user profile and item information to recommend the most relevant items, according to the user’s current session and activity. Do you have the infrastructure in place for real-time click streaming events back into Personalize? If not, don’t worry, we can help!</p><p>BUILD</p><p>Learn more about the AWS services available to build real-time streaming capabilities</p><p>BUY</p><p>AWS is partnering with multiple partners to translate and send your data to Amazon Personalize in the right format.</p><p class=\"font-weight-bold\">Provisioning capacity for real-time recommendations</p><p>Customers are charged based on the transaction-per-second (TPS) capacity provisioned or used, whichever is greater. When creating an Amazon Personalize campaign, a customer sets their minimum TPS capacity. TPS capacity is measured on a TPS-hour basis (rounded up to the nearest hour). If the customer’s transaction load exceeds the minimum provisioned capacity, Amazon Personalize will auto-scale based on the customer’s needs. In most cases when a customer starts with Amazon Personalize, we recommend provisioning the minimum (1 TPS), then experimenting to see the impact of Personalize for users. These learnings will help inform how to scale based on their needs to avoid unexpected charges due to over-provisioning.</p>"
    },
    {
        "name": "Batch recommendations",
        "title":"Batch recommendations",
        "text": "<p>While real-time recommendations are highly recommended, Amazon Personalize does support batch recommendations, which lets you generate personalized recommendations for a large number of users, or similar items for a large number of items, in one go, and then use them in batch processes, such as sending emails or notifications. </p>"
    },
    {
        "name": "Integrating Personalize with applications and existing tool",
        "title": "Integrating Personalize with applications and existing tool",
        "text": "<p>At the heart of the Retail Demo Store is a collection of polyglot microservices hosted in Amazon Elastic Container Service (AWS Fargate) that represent domain constructs such as products, carts, orders, and users as well as services for search and recommendations. While the web user interface is served by Amazon CloudFront and Amazon S3.</p><p>The architecture is supported by several managed services including Amazon Cognito, Amazon Pinpoint, Amazon Personalize, and Amazon Elasticsearch. The web user interface is built using the Vue.js framework with AWS Amplify to provide integrations with Cognito for registration/authentication and event streaming to Pinpoint and Personalize (Event Tracker). Finally, AWS CodePipeline is leveraged to demonstrate how AWS development services can be used to orchestrate the build and deployment process with the Retail Demo Store. Figure 2 depicts the system architecture.</p>"
    }

]